#ifndef __USART_H__
#define __USART_H__

/***************************************************************************************
 ** 头文件包含区
***************************************************************************************/
#include "stm32f10x.h"
#include <stdio.h>

/***************************************************************************************
 ** 宏定义区
***************************************************************************************/
extern int flag_YY;
extern int flag_LY;


/***************************************************************************************
 ** 函数声明区
***************************************************************************************/
void Usart1_Init(u32 baudrate); //串口1的初始化函数
void Usart2_Init(u32 baudrate); //串口2的初始化函数
void Usart3_Init(u32 baudrate); //串口3的初始化函数
void USART_SendDatas(USART_TypeDef *USARTx,unsigned char *SendBuf,uint8_t len); //通过指定串口将数据连续发送过去

#endif

